app/controllers/categories_controller.rb

  def show
    @category = Category.find(params[:id])
---
SELECT * FROM "categories" WHERE ("categories"."id" = 1)

  def edit
    @category = Category.find(params[:id])
---
SELECT * FROM "categories" WHERE ("categories"."id" = 1)

  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES('Louça', '2009-03-05 21:00:07', '2009-03-05 21:00:07')