app/controllers/policies_controller.rb

SELECT * FROM "policies" WHERE ("policies"."id" = 1)
---
  def show
    @policy = Policy.find(params[:id])

INSERT INTO "policies" ("name", "created_at", "menu_title", "updated_at", "text", "text_title") VALUES('Política de Venda', '2009-03-06 00:44:02', 'Política de Venda
---
  def create
    @policy = Policy.new(params[:policy])

    respond_to do |format|
      if @policy.save