app/controllers/products_controller.rb

  def index
    order = params[:order]
    order ||= 'name'
    @products = Product.paginate :page => params[:page], :order => order, :per_page => 30
---
SELECT * FROM "products"