app/controllers/products_controller.rb

  def view
    @product = Product.find params[:id]
---
SELECT * FROM "products" WHERE ("products"."id" = 1)

  def find
    verify_list_products_options

    if params[:search].blank?
      if params[:category_id_filter].blank?
        @products = Product.paginate :page => params[:page], :order => order, :per_page => per_page
      else
        @category_filter = Category.find(params[:category_id_filter])
        @products = Product.paginate :page => params[:page], :order => order, :per_page => per_page, :conditions => { :category_id => @category_filter.id }
      end
    else
      @search = params[:search]
      s = @search.downcase
      if params[:category_id_filter].blank?
        @products = (Product.paginate :page => params[:page], :order => order, :per_page => per_page, :conditions => "canonical_name like '%#{s}%'")
---
SELECT * FROM "products" WHERE (category_id = 1 AND canonical_name like '%faca%') ORDER BY name LIMIT 4 OFFSET 0
SELECT count(*) AS count_all FROM "products"
SELECT * FROM "categories" WHERE ("categories"."id" = 1)
SELECT * FROM "categories"
SELECT * FROM "products" WHERE ("products"."category_id" = 1) ORDER BY price LIMIT 4 OFFSET 0
SELECT count(*) AS count_all FROM "products" WHERE ("products"."category_id" = 1)
SELECT * FROM "products" WHERE ("products"."canonical_name" = '%#{params[:search]}%')

  def show
    @product = Product.find(params[:id])
---
SELECT * FROM "products" WHERE ("products"."id" = 1)

  def edit
    @product = Product.find(params[:id])
---
SELECT * FROM "products" WHERE ("products"."id" = 1)

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "price", "created_at", "canonical_name", "code", "featured", "updated_at", "category_id", "description") VALUES('Colher', NULL, '2009-03-05 21:01:33', 'colher', '', 'f', '2009-03-05 21:01:33', 1, 'Uma colher legal!')

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT * FROM "products" WHERE ("products"."id" = 1)
UPDATE "products" SET "updated_at" = '2009-03-05 21:09:17', "price" = 20.0 WHERE "id" = 1