app/controllers/site_controller.rb

UPDATE "sites" SET "updated_at" = '2009-03-06 02:34:20', "we_title" = 'Quem somos título', "we_text" = 'quem somos texto' WHERE "id" = 1
---
  def update
    if site.update_attributes(params[:site])