app/controllers/testimonials_controller.rb

SELECT * FROM "testimonials"
---
  def index
    @testimonials = Testimonial.paginate(:page => params[:page], :per_page => 20)