app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 4) LIMIT 1

  def index
    @users = User.all :conditions => "state NOT LIKE 'deleted' AND state NOT LIKE 'passive'"
---
SELECT * FROM "users"

  def create
    unless params[:aceitouTermos]
      @user = User.new(params[:user])
      flash[:error] = 'É necessário aceitar os termos de uso para criar uma nova conta.'
      render :action => 'new', :layout => 'application'
      return
    end

    logout_keeping_session!
    params[:user][:email].strip!

    user_by_mail = User.scoped_by_email(params[:user][:email]).first
---
SELECT "users".id FROM "users" WHERE ("users"."email" = 'jose@mail.com' AND "users".id <> 1) LIMIT 1

  def create_admin
    params[:user][:email].strip!
    user_by_mail = User.scoped_by_email(params[:user][:email]).first
    if user_by_mail and user_by_mail.can_be_created?
      @user = user_by_mail
      @user.attributes = params[:user]
    else
      @user = User.new(params[:user])
    end

    if params[:newsletter]
      @user.newsletter = true
    end

    @user.admin = !params[:user].delete(:admin).nil?

    @user.activate!

    if @user.save
---
SELECT "users".id FROM "users" WHERE ("users"."email" = 'joao@mail.com' AND "users".id <> 7) LIMIT 1
INSERT INTO "users" ("name", "salt", "created_at", "activated_at", "crypted_password", "remember_token_expires_at", "updated_at", "deleted_at", "activation_code", "admin", "remember_token", "login", "email", "state") VALUES('João', '7b9c9cb8612a523e104f8e202cd2d88e24d0c70f', '2009-03-06 01:20:58', '2009-03-06 01:20:58', '8c793ec708123521eb2b56b0a7dfc34c5111ee00', NULL, '2009-03-06 01:20:58', NULL, NULL, 't', NULL, 'joao', 'joao@mail.com', 'passive')

  def activate
    logout_keeping_session!
    user = User.find_by_activation_code(params[:activation_code]) unless params[:activation_code].blank?
---
SELECT * FROM "users" WHERE ("users"."activation_code" = '449c03356a26e5dc2e0ad26d508e742642f82235') LIMIT 1

  def find_user
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 6) LIMIT 1